tap "azure/functions"
tap "bufbuild/buf"
tap "caskroom/cask"
tap "dopplerhq/cli"
tap "go-task/tap"
tap "golangci/tap"
tap "goreleaser/tap"
tap "hashicorp/tap"
tap "ktr0731/evans"
tap "ngrok/ngrok"
tap "suzuki-shunsuke/pinact"
tap "tinygo-org/tools"
# Run your GitHub Actions locally
brew "act"
# Heavily optimized DEFLATE/zlib/gzip compression and decompression
brew "libdeflate"
# TIFF library and utilities
brew "libtiff"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# C parser in Python
brew "pycparser"
# C Foreign Function Interface for Python
brew "cffi"
# Cryptographic recipes and primitives for Python
brew "cryptography"
# Official Amazon AWS command-line interface
brew "awscli"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Collection of portable C++ source libraries
brew "boost"
# Core application library for C
brew "glib"
# GNU compiler collection
brew "gcc"
# Suite of Sparse Matrix Software
brew "suite-sparse"
# Tool to obtain certs from Let's Encrypt and autoenable HTTPS
brew "certbot"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Library for encoding and decoding .avif files
brew "libavif"
# Graphics library to dynamically manipulate images
brew "gd"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# Dependency Manager for PHP
brew "composer"
# Apjanke's fork of the classic cowsay project
brew "cowsay"
# Load/unload environment variables based on $PWD
brew "direnv"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# OpenType text shaping engine
brew "harfbuzz"
# LLVM bytecode to JavaScript compiler
brew "emscripten"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Image processing and image analysis library
brew "leptonica"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Light HTTP/1.1 server library
brew "libmicrohttpd"
# Framework for layout and rendering of i18n text
brew "pango"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line tools for fly.io services
brew "flyctl"
# Command-line outline and bitmap font editor/converter
brew "fontforge"
# Library for manipulating fonts
brew "fonttools"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Cross-platform application and UI framework
brew "qt"
# Command-driven, interactive function plotting
brew "gnuplot"
# Database migrations CLI tool
brew "golang-migrate"
# Image manipulation
brew "netpbm"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Like cURL, but for gRPC
brew "grpcurl"
# Deploy Kubernetes Helm Charts
brew "helmfile"
# Simple zero-configuration command-line HTTP server
brew "http-server"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# CLI wrapper for basic network utilities on macOS - ip command
brew "iproute2mac"
# Kubernetes controller and tool for one-way encrypted Secrets
brew "kubeseal"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Library to communicate with iOS devices natively
brew "libimobiledevice"
# Next-gen compiler infrastructure
brew "llvm"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# General-purpose lossless data-compression library
brew "zlib"
# NCurses Disk Usage
brew "ncdu"
# Libraries and data formats for array-oriented scientific data
brew "netcdf"
# JSON for modern C++
brew "nlohmann-json"
# Port scanning utility for large networks
brew "nmap"
# Open Visual Inference And Optimization toolkit for AI inference
brew "openvino"
# Python bindings for v6 of Qt
brew "pyqt"
# Toolkit for 3D computer graphics, image processing, and visualization
brew "vtk"
# Open source computer vision library
brew "opencv"
# PDF processor written in Go
brew "pdfcpu"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Cross-platform application and UI framework
brew "qt@5"
# Python bindings for v5 of Qt
brew "pyqt@5"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Ruby version manager
brew "rbenv"
# Shell Script Compiler
brew "shc"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Cross-shell prompt for astronauts
brew "starship"
# User interface to the TELNET protocol
brew "telnet"
# Powerful free data recovery utility
brew "testdisk"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Internet file retriever
brew "wget"
# Generate your Xcode project from a spec file and your folder structure
brew "xcodegen"
# Friendly and fast tool for sending HTTP requests
brew "xh"
# The best way of working with Protocol Buffers.
brew "bufbuild/buf/buf"
# The official Doppler CLI for managing your secrets
brew "dopplerhq/cli/doppler"
# Task runner / simpler Make alternative written in Go
brew "go-task/tap/go-task"
# Terraform
brew "hashicorp/tap/terraform"
# Evans: more expressive universal gRPC client
brew "ktr0731/evans/evans"
# Pin GitHub Actions versions
brew "suzuki-shunsuke/pinact/pinact"
# TinyGo is a Go compiler for small places. Microcontrollers, WebAssembly, and command-line tools. Based on LLVM.
brew "tinygo-org/tools/tinygo"
# JDK from the Java User Group (JUG)
cask "adoptopenjdk"
# Chromium based browser
cask "arc"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# All-in-one toolbox for developers
cask "devutils"
# App to build and share containerised applications and microservices
cask "docker"
cask "font-ipafont"
# Font editor and converter for outline and bitmap fonts
cask "fontforge"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Archive manager for data compression and backups
cask "rar"
# HTML to PDF renderer
cask "wkhtmltopdf"

brew "zsh"
brew "wezterm"
brew "antigen"
cask "raycast"
cask "visual-studio-code"
